Autodesk.Revit.DB.BuiltInFailures.ExportFailures.IFCGenericExportWarning
Unexpected errors occurred while exporting these elements to the IFC file.

Autodesk.Revit.DB.BuiltInFailures.ExportFailures.IFCFatalToolkitExportError
There has been an unrecoverable error during export.  Export will now be aborted.

Autodesk.Revit.DB.BuiltInFailures.ExportFailures.IFCFatalExportError
There has been an unrecoverable error during export.  Export will now be aborted.

Autodesk.Revit.DB.BuiltInFailures.ExportFailures
Failures about ExportFailures.